---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregate.Delete
zh: 删除、移除
source: html/4a16a3fb-3ebe-b28b-7e11-29783c0737c0.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate.Delete Method

**中文**: 删除、移除

Delete the aggregate object from the IFCFile model.

## Syntax (C#)
```csharp
public void Delete()
```